{
    "mapwidth": "6400",
    "mapheight": "4400",
    "categories": [
        {
            "id": "Precinct1",
            "color": "#bf5138",
            "title": "Precinct One",
            "show": "false"
        },
        {
            "id": "Precinct2",
            "color": "#db9537",
            "title": "Precinct Two",
            "show": "false"
        },
        {
            "id": "Precinct3",
            "color": "#4089a6",
            "title": "Precinct Three",
            "show": "false"
        },
        {
            "id": "Precinct4",
            "color": "#95ac5f",
            "title": "Precinct Four",
            "show": "false"
        },
        {
            "id": "Precinct5",
            "color": "#d95353",
            "title": "Precinct Five",
            "show": "false"
        },
        {
            "id": "Precinct6",
            "color": "#544173",
            "title": "Precinct Six",
            "show": "false"
        },
        {
            "id": "Major",
            "color": "#000000",
            "title": "Major Trade Ways",
            "show": "false"
        }
    ],
    "levels": [
        {
            "id": "sigil",
            "title": "Sigil",
            "map": "storage/images/en/map.jpg",
            "minimap": "storage/images/en/minimap.jpg",
            "locations": [
                 {
                    "id": "Bulwark",
                    "pin": "circular fontawesome fas fa-map-signs",
                    "fill": "#95ac5f",
                    "x": "0.4320",
                    "y": "0.5200",
                    "category": "Precinct4",
                    "title": "Bulwark",
                    "about": "A concrete jungle of low rising apartments that sits between Sunhome and Nivix.",
                    "description": "<img src='storage/images/boros.png'><p>The neighborhood between Sunhome and Nivix is filled with reinforced structures that serve as low-rent apartments and shops. Those who live in the Bulwark are mainly workers or professionals who see opportunity in supporting the Boros garrison.</p>"
                },
                {
                    "id": "BulwarkHealingCenter",
                    "pin": "circular fontawesome fas fa-flask",
                    "fill": "#95ac5f",
                    "x": "0.4320",
                    "y": "0.5322",
                    "category": "Precinct4",
                    "title": "Bulwark Healing Center",
                    "about": "The largest veteran's hospital in the 10th District and Boros garrison of Precinct 4.",
                    "description": "<img src='storage/images/boros.png'><p><strong>NPCs</strong>: Yuri of the Ordruun (Seargent, the boss on the ground, silent, male minotaur), Yavor Svoboda (Recruit, artificer, male human)<p>A small garrison that stands out in the Bulwark is the largest veteran's hospital in the Tenth District. The healers and apothecaries of the Boros Legion offer their services for a hefty fee. Current and former members of the Boros Legion receive free medical care. Angels secure the building and keep order.</p>"
                },
                {
                    "id": "Cobblebrute",
                    "pin": "circular fontawesome fas fa-fire",
                    "fill": "#95ac5f",
                    "x": "0.4520",
                    "y": "0.5400",
                    "category": "Precinct4",
                    "title": "Cobblebrute",
                    "about": "A hidden inn and tavern associated with the Gruul deep within Boros territory.",
                    "description": "<img src='storage/images/gruul.png'><p><strong>NPCs</strong>: Ruts, An old, guildless goblin who runs the place. His mother was Gruul, he left as he was not a warrior, but he still feels some loyalty to the Clans. He has no love for the Boros, thinking they are puppets who serve the angels.<p>The Cobblebrute is a Gruul Clan safehouse somewhat hidden - it's entrance is the basement and bottom floor of a low-rent apartment building. The establishment is viewed upon poorly by Bulwark inhabitants primarily due to the owners' anti-Orzhovian and anti-Boros philosophy. The Cobblebrute serves as a safe haven for Gruul who find themselves so far from the Red Wastes and so near the Boros Legion. The Boros are well aware of the establishment and choose not to interfere and interrupt it's operations, for fear that future Gruul safehouses go undetected.</p>"
                },
                {
                    "id": "TinStreetP4",
                    "pin": "circular fontawesome fas fa-road",
                    "fill": "#000000",
                    "x": "0.4695",
                    "y": "0.5610",
                    "category": "Major",
                    "title": "Tin Street",
                    "about": "The longest thoroughfare in the city, a vital center of trade, and a hub of activity day and night. ",
                    "description": "<img src='storage/images/boros.png'><p>In addition to its shopping attractions, Tin Street is also a popular spot for nightlife, with its many restaurants and theaters. Much of the street runs through the western part of Precinct Four, and other parts are claimed by goblin gangs. The prominent presence of Boros soldiers along the length of Tin Street helps the populace feel safer, but the threat of rubblebelt raiders and goblin thieves remains.</p>"
                },
                {
                    "id": "TinStreetDoor",
                    "pin": "circular fontawesome fas fa-dungeon",
                    "fill": "#000000",
                    "x": "0.4750",
                    "y": "0.5870",
                    "category": "Major",
                    "title": "Tin Street Door",
                    "about": "An offramp of Tin Street and the Bulwark serve as a doorway to Sigil, the City of Doors.",
                    "description": "<p>Doorway enters <a href='/city-of-doors/?location=RavnicaEmbassy'>Sigil (Ravnica Embassy)</a>.<br /></p><p>The exact key needed to transport to Sigil from this location is unknown, but to arrive from Sigil one must have a <em>Guild Keyrune</em>.</p>"
                },
                {
                    "id": "Millstone",
                    "pin": "circular fontawesome fas fa-beer",
                    "fill": "#544173",
                    "x": "0.3320",
                    "y": "0.5822",
                    "category": "Precinct6",
                    "title": "Millstone",
                    "about": "A seedy tavern that caters to the rough and rowdy.",
                    "description": "<p>A tavern that is well frequented by those who live on Foundry Street.</p>"
                }
            ]
        }
    ]
}
