{
	"mapwidth":"1896",
	"mapheight":"1066",
	"styles": [
		{
			"class": "blueish",
			"base": {
				"fill": "#000000",
				"fill-opacity": "0.1"
			},
			"hover": {
				"fill": "#000000",
				"fill-opacity": "0.2",
				"stroke": "#FFFFFF",
				"stroke-width": "2"
			},
			"active": {
				"fill": "#000000",
				"fill-opacity": "0.3",
				"stroke": "#FFFFFF",
				"stroke-width": "2"
			}
		}
	],
  "groups":[
		{
			"id": "planes",
			"title": "Planes",
			"toggle": "false",
			"legend": "true",
			"style": "blueish"
		},
		{
			"id": "worlds",
			"title": "Worlds",
			"toggle": "false",
			"legend": "true",
			"style": "blueish"
		},
		{
			"id": "areas",
			"title": "Areas of Interest",
			"toggle": "true",
			"legend": "true"
		}
  ],
	"levels":[
		{
			"id":"treasuresource",
			"title":"Treasure Source",
			"map":"maps/treasuresource.svg",
			"locations":[
				{
					"id": "materialplane",
					"title": "Prime Material Plane",
					"category": "planes",
					"description": "<p>The Prime Material plane contains the cosmic space that hosts crystal shards which each contain a single world. The plane is surrounded by an Ethereal plane that is shared by all shards. </p>",
					"pin": "hidden",
					"x": "0.51",
					"y": "0.46",
					"zoom": "1"
  			},
				{
					"id": "astralplane",
					"title": "Astral Plane",
					"category": "planes",
					"description": "<p>The Astral plane connected the Prime Material Planes to the first layers of the 17 Outer planes. The Outer Planes are built on <em><strong>belief</em></strong> and <em><strong>thought</em></strong>, such as order and chaos. It was described as a barren place of other-dimensional nothingness extending in all directions.</p><p><em>It is the space between everything.<br />It is the road that goes everywhere.</br>It is where you are when you aren't anywhere else.</br></em> - Read and documented from an inscription of a statue of a prime named Bigby, within the Lady's Ward of Sigil.</p>",
					"pin": "hidden",
					"x": "0.48",
					"y": "0.048",
					"zoom": "1"
				},
				{
					"id": "innerplanes",
					"title": "Inner Planes",
					"category": "planes",
					"description": "<p>The Inner Planes contained environments that are among the most hostile in the multiverse. Unlike the Outer Planes, which were built on belief and thought, the Inner Planes were the manifestation of central aspects of physical reality. This includes the purified and raw power of the elements .</p>",
					"pin": "hidden",
					"x": "0.3346",
					"y": "0.2475",
					"zoom": "1"
				},
				{
					"id": "etherealplane",
					"title": "Ethereal Plane",
					"category": "planes",
					"description": "<p>The Ethereal plane exists adjacent to the Prime Material Plane and connected it to the Inner planes. The Ethereal touched the Prime Material Plane at all points that were located within crystal shards through what is called the <em><strong>Border Ethereal</strong></em>. The non-Border region is called the <em><strong>Deep Ethereal</strong></em>.</p>",
					"pin": "hidden",
					"x": "0.4858",
					"y": "0.7083",
					"zoom": "1"
				},
				{
					"id": "outlands",
					"title": "Outlands",
					"category": "planes",
					"description": "<p>The Outlands resides in the Astral Plane and is known for it's connections to various other planes. It connects to the sixteen Outer Planes via large portals in sixteen Gate-Towns each located on the inner edge of the plane.  It is infinite, yet it has a definitive center where a large Spire ascends to the sky. At the Spire's tip, the floating torus shaped City of Doors: <em><strong>Sigil</em></strong>.</p><p> While traveling to the Outer Planes is not possible within Sigil, one can travel to the worlds of the Prime Material Plane via portals (or doors).</p><p>The Outlands is truly the planar hub of the multiverse - capable of providing transport to the Outer Planes and the Prime Material. or so I'm told. I can't wait to visit all of them! I wonder if there is a way to the <em>Inner Planes</em>?</p><p><small>Author's Note: While the map shows the Outlands within the Prime Material, it actually sits within the Astral Plane. Think of it as being under the Prime Material! It's why I dotted the line!</small></p>",
					"pin": "hidden",
					"x": "0.4646",
					"y": "0.4196",
					"zoom": "1"
				},
				{
					"id": "dromaria",
					"title": "Dromaria",
					"category": "worlds",
					 "description": "<p>This is where your faithful cartographer and writer hails from! It is a god forged world shrouded in mystery, where countless battles between the forces of good, evil, order and chaos have been fought infinitum. It is I, Danser Sunrun, who is the first (as far as I know!) to document Dromaria's true place in the larger existence known as the multiverse. Also, if anyone from the <em>Deadly Bones</em> reads this - know that Yenry Duskpeak has what you are owed.</p>",
					"pin": "hidden",
					"x": "0.3488",
					"y": "0.4390",
					"zoom": "2"
				},
				{
					"id": "khaldeim-gnottvold",
					"title": "Gnottvold",
					"description": "<p><em>Where Trolls Slumber</em></p><p><em>Visited, 32 after Awareness</em></p><p>The unspoiled wilds of Gnottvold are marked only by the overgrown ruins of ancient giants and occasional crude wooden shelters built by trolls. Your courageous writer discovered a large slumbering troll nearly a mountain large!</p>",
					"pin": "pin-square pin-label",
					"label": "images/troll.svg",
					"image": "images/torgatroll.jpg",
					"fill": "transparent",
					"category": "areas",
					"x": "0.3702",
					"y": "0.5271",
					"reveal": "2"
				},
				{
					"id": "khaldeim",
					"title": "Khaldeim",
					"category": "worlds",
					 "description": "<p><em>Visited, 32 after Awareness</em></p><p>Your ever so honest and faithful author ventured forth to the world of Khaldeim to hunt insectoid creatures called <em>phase spiders</em>. The creatures' remains serve as a main component for automatons whom wish to emulate the spiders.</p>",
					"pin": "hidden",
					"x": "0.3873",
					"y": "0.5010"
				},
				{
					"id": "toril",
					"title": "Toril",
					"category": "worlds",
					 "description": "<p><em>Visited, 1 after Awareness</em></p><p>Your astute champion and traveler of the multiverse found himself stranded in Toril. It is very similar to my homeworld of Dromaria and is a world of danger and adventure. I and my companions found ourselves on a beach of the <em>Sword Coast</em>, a region of the continent of <em>Faerun</em>, which takes it's name from the white cliffs that rose up sharply for hundreds of miles along the eastern coastline. It was from here our multiverse adventures began...",
					"pin": "hidden",
					"x": "0.5338",
					"y": "0.5341",
					"zoom": "2"
				}
			]
		}
	]
}
